

   # -*- coding: utf-8 -*-

# Задание номер один-1
def sumOfThree():
    print("Введите входные данные (3 числа)")
    x = int(input())
    y = int(input())
    z = int(input())
    print("Ответ:")
    sum = x + y + z
    return sum

print("\n")
print("Первое задание: ")
print(sumOfThree())
print("\n")