# -*- coding: utf-8 -*-
# Задание номер два-2
def countWords():
    exampleString = input("Введите строку - ")
    print("Ответ:")
    print(exampleString.count(" ") + 1)

countWords()